# AddField Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleDefinition..::..AddField Method
ScheduleDefinition Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddField(SchedulableField) | Adds a regular field at the end of the list. |
| AddField(ScheduleFieldType) | Adds a regular field at the end of the list. |
| AddField(ScheduleFieldType, ElementId) | Adds a regular field at the end of the list. |

# See Also
ScheduleDefinition Class
ScheduleDefinition Members
Autodesk.Revit.DB Namespace